{
  "default": {
    "siteName": "Archetype Original",
    "siteUrl": "https://www.archetypeoriginal.com",
    "titleTemplate": "%s | Archetype Original",
    "defaultTitle": "Archetype Original — Servant Leadership for Modern Teams",
    "description": "Archetype Original helps leaders build sustainable organizations through servant leadership, culture clarity, and proven systems for growth.",
    "keywords": "servant leadership, leadership consulting, business culture, executive mentorship, fractional leadership, Bart Paden",
    "image": "/og-default.jpg",
    "twitterHandle": "@archetypeoriginal"
  },
  "pages": {
    "about": {
      "title": "About Bart | Archetype Original",
      "description": "Bart Paden mentors executives, founders, emerging leaders, and students—helping them rebuild clarity and culture without dependency.",
      "keywords": "Bart Paden, servant leadership, executive mentor, leadership consulting, business culture, Archetype Original",
      "image": "/og-about.jpg"
    },
    "philosophy": {
      "title": "Philosophy | Archetype Original",
      "description": "The leadership and business philosophy behind Archetype Original: servant leadership, clarity, trust, and stewardship in practice.",
      "keywords": "leadership philosophy, servant leadership, business culture, leadership principles, Archetype Original",
      "image": "/og-philosophy.jpg"
    },
    "methods": {
      "title": "Methods | Archetype Original",
      "description": "Every engagement begins with listening. Every business has its own rhythm, and every leader carries unseen weight.",
      "keywords": "leadership methods, servant leadership framework, leadership systems, company culture, Archetype Original",
      "image": "/og-methods.jpg"
    },
    "what-we-do": {
      "title": "What We Do | Archetype Original",
      "description": "Archetype Original helps leaders and organizations thrive through mentorship, consulting, workshops, and fractional leadership—grounded in 32 years of real-world experience.",
      "keywords": "leadership consulting, executive coaching, workshops, fractional leadership, business mentoring, Archetype Original",
      "image": "/og-what-we-do.jpg"
    }
  }
}
